RIET/src/Documents/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Job</name>
  <posting>Deny</posting>
  <attributes>
    <name>Period</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTLNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>LocationName</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>CANumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Well</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>AmountInContractCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrencyOfContract</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseСurrencyTotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SIRNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accountant</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>SiebelOrder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CommentsForRevenueAccrual</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OFSStoreCaddy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JobDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceReimbursableAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceReimbursable</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProductReimbursableAccount</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductReimbursable</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DCSPartOfRevenue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Engineer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Documents/Job/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Period) и ЗначениеЗаполнено(Дата) Тогда 
		ЧислоМесяца = Число(Формат(Дата,"ДФ=dd"));
		Period = ?(ЧислоМесяца > 25, КонецМесяца(Дата)+1, НачалоМесяца(Дата)); 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(CreatedBy) Тогда 
		CreatedBy = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

    ПроверитьЗаполнениеРеквизитов(Отказ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	 	
	Если НЕ ЗначениеЗаполнено(Segment) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Необходимо заполнить поле ""Segment""!",
			ЭтотОбъект, "Segment", , Отказ);
	КонецЕсли;
	
	//проверим что нет другого Job с таким же FTL номером за тот же период
	Если ЗначениеЗаполнено(FTLNumber) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Job.Ссылка
		               |ИЗ
		               |	Документ.Job КАК Job
		               |ГДЕ
		               |	Job.FTLNumber = &FTLNumber
		               |	И Job.Period = &Period
		               |	И Job.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("FTLNumber", FTLNumber);
		Запрос.УстановитьПараметр("Period", Period);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Job с FTL number "+FTLNumber+" за период "+Формат(Period, "ДФ=MM.yyyy")+" уже создан для сегмента "+СокрЛП(Segment)+"!",
				, , , Отказ);
		КонецЕсли;
		  		
	КонецЕсли;
	       		      		
КонецПроцедуры
